DUNE_py/system/controlDicts/controlDict_fromSecond
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         60;

deltaT          0.5;

writeControl    adjustable;

writeInterval   5;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  on;

maxCo           0.8;

tolerance	1e-8;

functions
{
	wallShearStress1
	{
	    // Mandatory entries (unmodifiable)
	    type            wallShearStress;
    	    libs            (fieldFunctionObjects);
    	    
	    // Optional (inherited) entries
	    writePrecision  8;
	    writeToFile     true;
	    writeControl    adjustable;
	    writeInterval   5;
	    patches	    ("fixedWalls");
	}
}

// ************************************************************************* //
