DUNE_py/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\ 
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1.000000;

vertices 
(
(0.0   0.20195223426415257   0.0)
(50.0   0.20195223426415257   0.0)
(50.0   7.016549873261228   0.0)
(0.0   7.016549873261228   0.0)
(0.0   0.20195223426415257   0.1)
(50.0   0.20195223426415257   0.1)
(50.0   7.016549873261228   0.1)
(0.0   7.016549873261228   0.1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (25 70 1) simpleGrading (1 50 1)
);

edges 
(
     polyLine 0 1 ((1.0 0.17298892671452087 0) (3.0 0.10565703888692748 0) (5.0 0.02916351252356707 0) (7.0 -0.050845114299435445 0) (9.0 -0.12654405612357708 0) (11.0 -0.19209823457745634 0) (13.0 -0.24354507110161336 0) (15.0 -0.2783701932058824 0) (17.0 -0.2949867822721249 0) (19.0 -0.2944919167467653 0) (21.0 -0.2773750070745444 0) (23.0 -0.24145895247482083 0) (25.0 -0.18978934382338655 0) (27.0 -0.12712506365976475 0) (29.0 -0.058022011384938184 0) (31.0 0.014442741673578416 0) (33.0 0.08682129098889614 0) (35.0 0.15275795039186527 0) (37.0 0.2089166211770738 0) (39.0 0.2519356436813793 0) (41.0 0.27959358813704727 0) (43.0 0.29098611784145706 0) (45.0 0.2870782219271608 0) (47.0 0.266827441945066 0) (49.0 0.22748265085577124 0) )
    polyLine 4 5 ((1.0 0.17298892671452087 0.1) (3.0 0.10565703888692748 0.1) (5.0 0.02916351252356707 0.1) (7.0 -0.050845114299435445 0.1) (9.0 -0.12654405612357708 0.1) (11.0 -0.19209823457745634 0.1) (13.0 -0.24354507110161336 0.1) (15.0 -0.2783701932058824 0.1) (17.0 -0.2949867822721249 0.1) (19.0 -0.2944919167467653 0.1) (21.0 -0.2773750070745444 0.1) (23.0 -0.24145895247482083 0.1) (25.0 -0.18978934382338655 0.1) (27.0 -0.12712506365976475 0.1) (29.0 -0.058022011384938184 0.1) (31.0 0.014442741673578416 0.1) (33.0 0.08682129098889614 0.1) (35.0 0.15275795039186527 0.1) (37.0 0.2089166211770738 0.1) (39.0 0.2519356436813793 0.1) (41.0 0.27959358813704727 0.1) (43.0 0.29098611784145706 0.1) (45.0 0.2870782219271608 0.1) (47.0 0.266827441945066 0.1) (49.0 0.22748265085577124 0.1) )
); 

boundary
(

    rigidLid
    {
        type wall;
        faces
        (
            (3 7 6 2)
        );
    }
    
    bed
    {
        type wall;
        faces
        (
            (1 5 4 0)
        );
    }
    inlet
    {
     type   cyclic;
     neighbourPatch outlet;
     faces ((0 4 7 3));
    }
    outlet
    {
     type   cyclic;
     neighbourPatch  inlet;
     faces  ((1 2 6 5));
    }            
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
