DUNE_py/system/temp/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (0  0   0)
    (0.1 0   0)
    (0.1 1   0)
    (0  1   0)
    (0  0   0.1)
    (0.1 0   0.1)
    (0.1 1   0.1)
    (0  1   0.1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (1 30 1) simpleGrading (1 4 1)
);

/* *\
edges
(
	polyLine 0 1 ((3.5 0.15 0) (7 0.3 0))
	polyLine 4 5 ((3.5 0.15 0.1) (7 0.3 0.1))
);

\* */

boundary
(

    rigidLid
    {
        type wall;
        faces
        (
            (3 7 6 2)
        );
    }
    
    fixedWalls
    {
        type wall;
        faces
        (
            (1 5 4 0)
        );
    }
    inlet
    {
     type   cyclic;
     neighbourPatch outlet;
     faces ((0 4 7 3));
    }
    outlet
    {
     type   cyclic;
     neighbourPatch  inlet;
     faces  ((1 2 6 5));
    }            
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
