DUNE_py/constant/forceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      forceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// * * * * * * * * * * * * * following are for presure * * * * * * * * * * * * * * * //
gradPMEAN       gradPMEAN        [ 1 -2 -2 0 0 0 0 ] (1.1841 0 0 ); // mean pressure

//writeTau        true;

//debugInfo	true; 

// * * * * * * * * * * * * end of definition of pressure * * * * * * * * * * * * * //
