DUNE_py/constant/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


accelerationSource1
{
    type            tabulatedAccelerationSource;
    active		yes;
    
    tabulatedAccelerationSourceCoeffs
    {
	    selectionMode   cellSet;
	    cellSet         sourceCells1;
	    fields          (U);

	    timeDataFileName "constant/acceleration-terms.dat";
    }
}

// ************************************************************************* //
