DUNE_py/constant/g
/*--------------------------------*- C++ -*----------------------------------*\
|       o          |                                                          |
|    o     o       | OpenFOAM (Engys Edition):                                |
|   o   O   o      | Version: 2.2_engysEdition-beta                           |
|    o     o       | Web:     http://www.engys.com                            |
|       o          |                                                          |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      binary;
    class       dictionary;
    location    "../constant";
    object      g;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -2 0 0 0 0 ];

value           ( 0 -9.8065 0);

// ************************************************************************* //
