DUNE_py/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-10;
        relTol          0.05;
    }
    
    pFinal
    {
        $p;
        tolerance       1e-10;
        relTol          0;
    }

/*
    pFinal
    {
        $p;
        tolerance       1e-7;
        relTol          0;
    }

    "(UFinal|kFinal|epsilonFinal|omegaFinal)"
    {
 //   	$U;
    	solver		smoothSolver;
    	smoother	GaussSeidel;
    	tolerance 	1e-7;
    	relTol		0;
    }
  */  
    "(U|k|epsilon|omega|R|nuTilda)"
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        tolerance       1e-10;
        relTol          0.05;
    }
    
    "(U|k|epsilon|omega|R|nuTilda)Final"
    {
        $U;
        tolerance       1e-10;
        relTol          0;
    }
}

PISO
{
    nCorrectors     2;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0.0;
}

PIMPLE
{
    nCorrectors     2;
    nOuterCorrectors	10;
    nNonOrthogonalCorrectors 1;
    pRefCell        0;
    pRefValue       0.0;
    
    residualControl
    {
        U
        {
                tolerance  1e-5;
                relTol      0;
        }
        p
        {
                tolerance  5e-4;
                relTol      0;
        }
     }
}

SIMPLE
{
    nNonOrthogonalCorrectors 1;
    pRefCell        0;
    pRefValue       0.0;
    
 //   nOuterCorrectors	0;
    
    residualControl
    {
        p               1e-4;
        U               1e-4;
        "(k|omega)"     1e-4;
    }
    /*
    nCorrectors     2;
    nOuterCorrectors	10;
    nNonOrthogonalCorrectors 1;
    
 
    residualControl
    {
        p               1e-5;
        U               1e-5;
        nuTilda         1e-5;
    }
	*/
 
}

relaxationFactors
{

    fields
    {
        p               0.4;
    }
  
    equations
    {
        U               0.8;
        k               0.8;
        "omega.*"       0.8;
    }
}

/*
relaxationFactors
{
    fields
    {
        p        1;
        pFinal   1;
    }
    
    equations
    {
        "U|k|epsilon"     0.8;
        "(U|k|epsilon)Final"   1;
    }
    
}
*/

// ************************************************************************* //
